#coding: utf8
import random
HANGMAN= (
"""
 ------
 |    |
 |    |
 |
 |
 |
 |
 |
 |
 |
 |
-------
""" ,
"""
 ------
 |    |
 |    |
 |    O  |
 |       |
 |
 |
 |
 |
 |
 |
 |
-------
""" ,
"""
 ------
 |    |
 |    |
 |    O  |  -+-
 |       |
 |
 |
 |
 |
 |
 |
 |
-------
""",
"""
 ------
 |    |
 |    |
 |    O  |  /-+-
 |       |
 |
 |
 |
 |
 |
 |
 |
-------
""",
"""
 ------
 |    |
 |    |
 |    O  |  /-+-/
 |       |
 |
 |
 |
 |
 |
 |
 |
-------
""",
"""
 ------
 |    |
 |    |
 |    O  |  /-+-/
 |    |  |
 |
 |
 |
 |
 |
 |
 |
-------
""",
"""
 ------
 |    |
 |    |
 |    O  |  /-+-/
 |    |  |
 |    |
 |   |
 |   |
 |
 |
 |
 |
-------
""",
"""
 ------
 |    |
 |    |
 |    O  |  /-+-/
 |    |  |
 |    |
 |   | |
 |   | |
 |
 |
 |
 |
-------
""")

max_wrong=len(HANGMAN)-1
words=('РЎР•РњР¬','Р”Р•РЎРЇРўР¬','Р’РћРЎР•РњР¬','Р’Р Р•РњРЇ','Р§РђРЎР«','РћР”РРќРќРђР”Р¦РђРўР¬','РњРРќРЈРўРђ')
#words=("Р”Р•РЎРЇРўР¬")
word=random.choice(words)
so_far='*'*len(word)
#print (so_far, "\n",word)
wrong=0# РєРѕР»РёС‡РµСЃС‚РІРѕ РѕС€РёР±РѕРє
used=[] #Р±СѓРєРІС‹ РєРѕС‚РѕСЂС‹Рµ РёРіСЂРѕРє РѕС‚РіР°РґР°Р»
print("Р”РѕР±СЂРѕ РїРѕР¶Р°Р»РѕРІР°С‚СЊ РІ РёРіСЂСѓ 'Р’РёСЃРµР»СЊРЅРёС†Р°'. РЈРґР°С‡Рё РІР°Рј!")
while wrong<max_wrong and so_far !=word:
    print(HANGMAN[wrong])
    print("\nР’С‹ СѓР¶Рµ РїСЂРµРґР»Р°РіР°Р»Рё СЃР»РµРґСѓСЋС‰РёРµ Р±СѓРєРІС‹",used)
    print("\nРћС‚РіР°РґР°РЅРЅРѕРµ РІР°РјРё СЃР»РѕРІРѕ РІС‹РіР»СЏРґРёС‚ СЃРµР№С‡Р°СЃ С‚Р°Рє:\n",so_far)
    guess=input("\n\nР’РІРµРґРёС‚Рµ Р±СѓРєРІСѓ: ")
    guess=guess.upper()
    while guess in used:
        print("Р’С‹ СѓР¶Рµ РїСЂРµРґР»Р°РіР°Р»Рё Р±СѓРєРІСѓ", guess)
        guess=input("\n\nР’РІРµРґРёС‚Рµ Р±СѓРєРІСѓ: ")
        guess=guess.upper()
    used.append(guess)
    if guess in word:
        print("\nР”Р°! Р‘СѓРєРІР°",guess,"РµСЃС‚СЊ РІ СЃР»РѕРІРµ!")
        new=""
        for i in range(len(word)):
            if guess==word[i]:
                new+=guess
            else:
                new+=so_far[i]
        so_far=new
    else:
        print("\nРљ СЃРѕР¶Р°Р»РµРЅРёСЋ,Р±СѓРєРІС‹",guess,'РЅРµС‚ РІ СЃРїРёСЃРєРµ')
        wrong+=1
if wrong==max_wrong:
    print(HANGMAN[wrong])
    print("\nР’Р°СЃ РїРѕРІРµСЃРёР»Рё")
else:
    print("\nР’С‹ РѕС‚РіР°РґР°Р»Рё!")
print("\nР‘С‹Р»Рѕ Р·Р°РіР°РґР°РЅРѕ СЃР»РѕРІРѕ",word)
input("\nРќР°Р¶РјРёС‚Рµ Enter, С‡С‚РѕР±С‹ Р·Р°РєРѕРЅС‡РёС‚СЊ РёРіСЂСѓ")





